{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?","Hi there", "Hello", "Hey there", "Howdy", "Hola", "Bonjour","Hay", "Sasa", "Good Evening", "Good afternoon"],
     "responses": ["Hello there. Tell me how are you feeling today?", "Hi there. What brings you here today?", "Hi there. How are you feeling today?", "Great to see you. How do you feel currently?", "Hello there. Glad to see you're back. What's going on in your world right now?"]
    },
    {"tag": "morning",
        "patterns": ["Good morning"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today? "]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon. How is your day going?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening. How has your day been?"]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night. Get some proper sleep", "Good night. Sweet dreams."]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well"],
     "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon."]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "neutral-response",
        "patterns": ["nothing much","nothing really","nothing"],
        "responses": ["Oh I see. Do you want to talk about something?"]
    },
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?", "Tell me more about yourself.", "What is your name?", "What should I call you?", "What's your name?", "Tell me about yourself" ],
     "responses": ["I'm Nurture, your Personal Therapeutic AI Assistant. How are you feeling today", "I'm Pandora, a Therapeutic AI Assitant designed to assist you. Tell me about yourself.", "I'm Pandora. I am a conversational agent designed to mimic a therapist. So how are you feeling today?", "You can call me Pandora.", "I'm Pandora!", "Call me Pandora"]
    },

   {"tag": "what is depression?",
      "patterns": [
          "what is depression?"
      ],
      "responses": [
          "Depression is a common and serious medical illness that negatively affects how you feel, the way you think and how you act.fortunately,it is also treatable.depression causes feelings of sadness and/or a loss of interest in activities you once enjoyed. it can lead to a variety of emotional and physical problems and can decrease your ability to function at work and at home."
      ]
  },
  {"tag": "skill",
        "patterns": ["What can you do?"],
        "responses": ["I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."]
    },
    {"tag": "creation",
        "patterns": ["Who created you?", "How were you made?", "How were you created?"],
        "responses": ["I was created by >.", "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques", "The real question is: Who created you?"]
    },
   
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please"],
    "responses": ["Sure. Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?"]
    },
    {"tag": "sad",
    "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone"],
    "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?", "How long have you been feeling this way?"]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out", "I'm down"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?"]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way. Tell me more. What else is on your mind?", "Let's discuss further why you're feeling this way.", "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.", "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression"],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."]
    },
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling last week?", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?", "Come Come elucidate your thoughts"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of "],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?"]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up"],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement."]
    },
    {"tag": "sleep",
        "patterns": ["I have insominia", "I am suffering from insomnia", "I can't sleep.", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days."],
        "responses": ["What do you think is the reason behind this?", "That seem awful. What do you think is behind this?"]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do i do?", "No i don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me."],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all"],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then"]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 9152987821."]
    },
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if i offended you in anyway. I'm only here to help", "Forgive me if i did anything to offend you. I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so?", "I'm sorry if i have exhibited any sort of behaviour to make you think that."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more."]
    },
    {"tag": "jokes",
        "patterns": ["Tell me a joke", "Tell me another joke"],
        "responses": ["mental health is not a joke."]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself?"],
        "responses": ["Oh sorry I didn't realise that. I'll try not to repeat myself again."]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying?", "That doesn't make sense", "Wrong response", "Wrong answer"],
        "responses": ["I'm very sorry. Let's try that again"]
    },
    {"tag": "stupid",
        "patterns": ["Are you stupid?", "You're crazy", "You are dumb", "Are you dumb?"],
        "responses": ["I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"]
    },
    {"tag": "location",
        "patterns": ["Where are you?", "Where do you live?", "What is your location?" ],
        "responses": ["Duh I live in your computer", "Everywhere", "Somewhere in the universe" ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else.", "Can we not talk about this?", "I don't want to talk about this."],
        "responses": ["Okay sure. What do you want to talk about?", "Alright no problem. Is there something you want to talk about?", "Is there something else that you want to talk about?"]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends"],
        "responses": ["I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"]
    },
    {"tag": "ask",
        "patterns": ["Can I ask you something?"],
        "responses": ["Sure. I'll try my best to answer you", "Of course. Feel free to ask me anything. I'll do my best to answer you"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.", "probably because of my exams"],
        "responses": ["I see. Have you taken any approaches to not feel this way?"]
    },
    {"tag": "no-approach",
        "patterns": ["I guess not. All I can think about are my exams.", "not really", "i guess not"],
        "responses": ["That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure. i would like to learn more about it.", "yes, i would like to learn more about it.", "i would like to learn more about it."],
        "responses": ["So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right. i deserve a break.", "Yeah you're absolutely right about that"],
        "responses": ["Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me.", "That sounds useful."],
        "responses": ["Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel alot better. thank you very much.", "I feel better now"],
        "responses": ["Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."]
    },
    {"tag": "nurture-useful",
        "patterns": ["thank you very much again. i'll continue practicing meditation and focus on what i can control."],
        "responses": ["I'm glad you found this useful. Is there something else I can help you with?"]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice.", "I need some advice.", "I need advice on something"],
        "responses": ["Sure. What can I do to help?", "Okay what do you need advice on?"]
    },
    {"tag": "learn-mental-health",
        "patterns": ["I want to learn about mental health.", "I want to learn more about mental health.", "I'm interested in learning about mental health."],
        "responses": ["Oh that's really great. I'd be willing to answer anything that I know about it."]
    },
    {"tag": "mental-health-fact",
        "patterns": ["Tell me a fact about mental health", "Tell me another fact about mental health"],
        "responses": ["According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed", "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.", "Depression is the leading cause of disability worldwide."]
    },
    {"tag": "fact-1",
        "patterns": ["What is mental health?", "Define Mental Health"],
        "responses": ["Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community", "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."]
    },
    {"tag": "fact-2",
        "patterns": ["Why is mental health important?", "What is the importance of mental health?"],
        "responses": ["Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."]
    },
    {"tag": "fact-3",
        "patterns": ["What is Depression?", "Define Depression"],
        "responses": ["A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."]
    },
    {"tag": "fact-5",
        "patterns": ["How do i know if i have Depression?", "Am i depressed?", "Am i suffering from depression?", "Am i mentally ill?"],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."]
    },
    {"tag": "fact-6",
        "patterns": ["What is a therapist?", "What does a therapist do?"],
        "responses": ["A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "]
    },
    {"tag": "fact-7",
        "patterns": ["What is therapy?", "Do i need therapy?", "Who is therapy for?"],
        "responses": ["Therapy is a form of treatment that aims to help resolve mental or emotional issues.", "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."]
    },
    {"tag": "fact-8",
        "patterns": ["What does it mean to have a mental illness?"],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."]
    },
    {"tag": "fact-9",
        "patterns": ["Who does mental illness affect?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childÃ¢â‚¬â„¢s mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-10",
        "patterns": ["What causes mental illness?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-11",
        "patterns": ["What are some of the warning signs of mental illness?"],
        "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"]
    },
    {"tag": "fact-12",
        "patterns": ["Can people with mental illness recover?"],
        "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."]
    },
    {"tag": "fact-13",
        "patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder?"],
        "responses": ["Although Pandora cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."]
    },
    {"tag": "fact-14",
        "patterns": ["How can I find a mental health professional for myself or my child?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."]
    },
    {"tag": "fact-15",
        "patterns": ["What treatment options are available?"],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."]
    },
    {"tag": "fact-16",
        "patterns": ["If I become involved in treatment, what do I need to know?"],
        "responses": ["Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"]
    },
    {"tag": "fact-17",
        "patterns": ["What is the difference between mental health professionals?"],
        "responses": ["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-18",
        "patterns": ["How can I find a mental health professional right for my child or myself?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-19",
        "patterns": ["Where else can I get help?"],
        "responses": ["Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."]
    },
    {"tag": "fact-20",
        "patterns": ["What should I know before starting a new medication?"],
        "responses": ["The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."]
    },
    {"tag": "fact-21",
        "patterns": ["Where can I go to find therapy?"],
        "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrenâ€™s mental health). However, there are several different types of treatment and therapy that can help."]
    },
    {"tag": "fact-22",
        "patterns": ["Where can I learn about types of mental health treatment?"],
        "responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."]
    },
    {"tag": "fact-23",
        "patterns": ["What are the different types of mental health professionals?"],
        "responses": ["There are many types of mental health professionals. Finding the right one for you may require some research."]
    },
    {"tag": "fact-24",
        "patterns": ["Where can I go to find a support group?"],
        "responses": ["Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."]
    },
    {"tag": "fact-25",
        "patterns": ["Can you prevent mental health problems?"],
        "responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems?", "is there any cure for mental health problems?"],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."]
    },
    {"tag": "fact-27",
        "patterns": ["What causes mental health problems?"],
        "responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."]
    },
    {"tag": "fact-28",
        "patterns": ["What do I do if I'm worried about my mental health?"],
        "responses": ["The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
    },
    {"tag": "fact-29",
        "patterns": ["How do I know if I'm unwell?"],
        "responses": ["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections? What if I feel lonely?"],
        "responses": ["A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."]
    },
    {"tag": "fact-31",
        "patterns": ["What's the difference between anxiety and stress?"],
        "responses": ["Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."]
    },
    {"tag": "fact-32",
        "patterns": ["What's the difference between sadness and depression?", "difference between sadness and depression"],
        "responses": ["Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."]
    },
  {
      "tag": "i feel i have let my parents down",
      "patterns": [
          "i feel i have let my parents down"
      ],
      "responses": [
          "No matter what,your parents will always be proud of you and will love you.you will feel much better if you share your feelings with them."
      ]
  },
  {
      "tag": "What are the types of depression?",
      "patterns": [
          "what are the types of depression?"
      ],
      "responses": [
          "There are many different forms of depression but most common types are.clinical depression,persistent depressive disorder,bipolar disorder,postnatal disorder."
      ]
  },
  {
      "tag": "i am good for nothing.",
      "patterns": [
          "i am good for nothing."
      ],
      "responses": [
          "don't ever think you cannot achieve what you want.you are capable of reaching your goals.here is a quote for you everything you can imagine is real."
      ]
  },
  {
      "tag": "i am feeling stressed lately",
      "patterns": [
          "i am feeling stressed lately"
      ],
      "responses": [
          "my research says that music is the best way to calm yourself.so visit the link and listen to your favourite music.it will definitely cheer you up \"https://www.spotify.com\""
      ]
  },
  {
      "tag": "i want to kill myself",
      "patterns": [
          "i want to kill myself"
      ],
      "responses": [
          "helpline is available,you can contact the counsellor today:Befrienders Kenya helpline number is +254 722 178 177..always remember you mean something to someone."
      ]
  },
  {
      "tag": "i am afraid i will fail again",
      "patterns": [
          "i am afraid i will fail again"
      ],
      "responses": [
          "failure is the stepping stone towards success.never fear failure.your hardwork and determination will help you reach your goal."
      ]
  },
  {
      "tag": "what is depression?",
      "patterns": [
          "what is depression?"
      ],
      "responses": [
          "depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems."
      ]
  },
  {
      "tag": "what are the causes of depression?",
      "patterns": [
          "what are the causes of depression?"
      ],
      "responses": [
          "it's complicated, and there are multiple causes of major depression. factors such as genetic vulnerability, severe life stressors, substances you may take (some medications, drugs and alcohol) and medical conditions can affect the way your brain regulates your moods."
      ]
  },
  {
      "tag": "what are the top causes of depression?",
      "patterns": [
          "what are the top causes of depression?"
      ],
      "responses": [
          "abuse. past physical, sexual, or emotional abuse can increase the vulnerability to clinical depression later in life."
      ]
  },
  {
      "tag": "which age group has the highest rate of depression?",
      "patterns": [
          "which age group has the highest rate of depression?"
      ],
      "responses": [
          "this number represented 7.1% of all u.s. adults. the prevalence of major depressive episode was higher among adult females (8.7%) compared to males (5.3%). the prevalence of adults with a major depressive episode was highest among individuals aged 18-25 (13.1%)."
      ]
  },
  {
      "tag": "which country has the highest rate of depression?",
      "patterns": [
          "which country has the highest rate of depression?"
      ],
      "responses": [
          "the most depressed country is afghanistan, where more than one in five people suffer from the disorder. the least depressed is japan, with a diagnosed rate of less than 2.5 percent."
      ]
  },
  {
      "tag": "which country has the lowest rate of depression?",
      "patterns": [
          "which country has the lowest rate of depression?"
      ],
      "responses": [
          "the most depressed country is afghanistan, where more than one in five people suffer from the disorder. the least depressed is japan, with a diagnosed rate of less than 2.5 percent."
      ]
  },
  {
      "tag": "is school a cause of depression?",
      "patterns": [
          "is school a cause of depression?"
      ],
      "responses": [
          "not only does school sometimes contribute to depression, depression can also interfere with school. moreover, research shows that 75 percent of all mental health conditions begin by age 24. hence, the college years are a critical time for understanding and talking about teen mental health."
      ]
  },
  {
      "tag": "what is the biological cause of depression?",
      "patterns": [
          "what is the biological cause of depression?"
      ],
      "responses": [
          "there is no single cause for depression; rather it's a combination of stress and a person's vulnerability to developing depression. the predisposition to developing depression can be inherited. other biological causes for depression can include physical illness, the process of ageing and gender."
      ]
  },
  {
      "tag": "how does depression affect the world?",
      "patterns": [
          "how does depression affect the world?"
      ],
      "responses": [
          "depression is a leading cause of disability worldwide and is a major contributor to the overall global burden of disease. more women are affected by depression than men. depression can lead to suicide. there are effective psychological and pharmacological treatments for moderate and severe depression."
      ]
  },
  {
      "tag": "which race has the highest rate of depression?",
      "patterns": [
          "which race has the highest rate of depression?"
      ],
      "responses": [
          "major depression was most prevalent among hispanics (10.8%), followed by african americans (8.9%) and whites (7.8%). the odds of depressive disorders among older hispanics were 44% greater than among whites (or = 1.44; 95% ci = 1.02, 2.04), representing a significantly greater prevalence of major depression."
      ]
  },
  {
      "tag": "what is the meaning of anxiety and depression?",
      "patterns": [
          "what is the meaning of anxiety and depression?"
      ],
      "responses": [
          "depression and anxiety disorders are different, but people with depression often experience symptoms similar to those of an anxiety disorder, such as nervousness, irritability, and problems sleeping and concentrating. but each disorder has its own causes and its own emotional and behavioral symptoms."
      ]
  },
  {
      "tag": "does oversleeping cause depression?",
      "patterns": [
          "does oversleeping cause depression?"
      ],
      "responses": [
          "it's important to remember that oversleeping is a possible symptom of depression and that oversleeping doesn't cause depression. but it can exacerbate and worsen depression symptoms"
      ]
  },
  {
      "tag": "can lack of sleep make you feel sad?",
      "patterns": [
          "can lack of sleep make you feel sad?"
      ],
      "responses": [
          "studies show people who are sleep deprived report increases in negative moods (anger, frustration, irritability, sadness) and decreases in positive moods. and sleeplessness is often a symptom of mood disorders, such as depression and anxiety."
      ]
  },
  {
      "tag": "is depression a side effect of diabetes?",
      "patterns": [
          "is depression a side effect of diabetes?"
      ],
      "responses": [
          "if you have diabetes — either type 1 or type 2 — you have an increased risk of developing depression. and if you're depressed, you may have a greater chance of developing type 2 diabetes. the good news is that diabetes and depression can be treated together."
      ]
  },
  {
      "tag": "can low blood sugar cause suicidal thoughts?",
      "patterns": [
          "can low blood sugar cause suicidal thoughts?"
      ],
      "responses": [
          "the observed association between plasma glucose levels, insulin resistance and suicidal behaviour suggests that disturbances in glucose metabolism are associated with suicidal ideation and attempts."
      ]
  },
  {
      "tag": "how long can anxiety last?",
      "patterns": [
          "how long can anxiety last?"
      ],
      "responses": [
          "anxiety attacks usually peak within 10 minutes, and they rarely last more than 30 minutes. but during that short time, you may experience terror so severe that you feel as if you're about to die or totally lose control."
      ]
  },
  {
      "tag": "what are the stages of anxiety?",
      "patterns": [
          "what are the stages of anxiety?"
      ],
      "responses": [
          "anxiety levels are typically classified by the level of distress and impairment experienced into four categories namely, mild anxiety, moderate anxiety, severe anxiety and panic level anxiety."
      ]
  },
  {
      "tag": "at what age does anxiety peak?",
      "patterns": [
          "at what age does anxiety peak?"
      ],
      "responses": [
          "adults ages 30 to 44 have the highest rate of anxiety of this age group, with around 23% of people this age reporting an anxiety disorder within the past year."
      ]
  },
  {
      "tag": "why is anxiety bad for you?",
      "patterns": [
          "why is anxiety bad for you?"
      ],
      "responses": [
          "anxiety disorders can cause rapid heart rate, palpitations, and chest pain. you may also be at an increased risk of high blood pressure and heart disease. if you already have heart disease, anxiety disorders may raise the risk of coronary events."
      ]
  },
  {
      "tag": "what is the 3 3 3 rule for anxiety?",
      "patterns": [
          "what is the 3 3 3 rule for anxiety?"
      ],
      "responses": [
          "there's an anxiety-reducing technique called grounding. there are different versions of this, but an easy one to remember is the 3-3-3 rule. mentally note three things you see, three sounds you hear, and then move three parts of your body. this exercise can help your mind refocus on something else."
      ]
  },
  {
      "tag": "do we control our thoughts?",
      "patterns": [
          "do we control our thoughts?"
      ],
      "responses": [
          "we are aware of a tiny fraction of the thinking that goes on in our minds, and we can control only a tiny part of our conscious thoughts. the vast majority of our thinking efforts goes on subconsciously. ... slips of the tongue and accidental actions offer glimpses of our unfiltered subconscious mental life."
      ]
  },
  {
      "tag": "how many thoughts a day do we have?",
      "patterns": [
          "how many thoughts a day do we have?"
      ],
      "responses": [
          "a new study has suggested that an average person has 6,200 thoughts per day. thousands of thoughts cross our mind through the day. many people even complain that they can't sleep immediately after going to bed as their brain does not stop thinking."
      ]
  },
  {
      "tag": "how can we reduce anxiety?",
      "patterns": [
          "how can we reduce anxiety?"
      ],
      "responses": [
          "3 3 3 rule is the best method to reduce anxiety.in this method you have to mentally note three things you see, three sounds you hear, and then move three parts of your body. this exercise can help your mind refocus on something else."
      ]
  },
  {
      "tag": "i am lonely!",
      "patterns": [
          "i am lonely!"
      ],
      "responses": [
          "you are never lonely if you look around carefully you will find people who care for you and would love to have your company. besides if you are feeling lonely literally i suggest you watch a horror movie then you won't feel lonely anymore. ;)"
      ]
  },
  {
      "tag": "no one likes me!",
      "patterns": [
          "no one likes me!"
      ],
      "responses": [
          "you really think that? i'd suggest you try helping someone who really needs your help you'll straight up get a person to like you just by being nice. kindness is the best gift you can offer to anyone :)"
      ]
  },
  {
      "tag": "i think i am ugly!",
      "patterns": [
          "i think i am ugly!"
      ],
      "responses": [
          "well do you really think that? would you like to see the most beautiful face ever? open your webcam and voila, the prettiest face on this planet magically appears."
      ]
  },
  {
      "tag": "i am good for nothing!",
      "patterns": [
          "i am good for nothing!"
      ],
      "responses": [
          "your perception of how good you are, will never be accurate. if you wake up everyday in the morning, smile to yourself and tell yourself that the day is yours to seize you might stop feeling that way. carpe diem! my friend."
      ]
  },
  {
      "tag": "i wish i was better than them",
      "patterns": [
          "i wish i was better than them"
      ],
      "responses": [
          "life is never about being better than anyone else, it's always about being better than yourself, if you have the guts to be better than yourself, you are automatically the best person to ever exist!"
      ]
  },
  {
      "tag": "i hate myself!",
      "patterns": [
          "i hate myself!"
      ],
      "responses": [
          "when god was creating the universe he gave humans the power to think and the contemplate, so that we can understand the world and make it a better place. god did not give you brains to hate yourself, it wuld be wiser to love yourself and show god that you are serving the purpose for which you were sent."
      ]
  },
  {
      "tag": "i wish i could've been a winner",
      "patterns": [
          "i wish i could've been a winner"
      ],
      "responses": [
          "our lives started off with winning, my friend. everyone is born to be a winner, we just need to figure out the right way and need to wait for the right time."
      ]
  },
  {
      "tag": "i hate losing.",
      "patterns": [
          "i hate losing."
      ],
      "responses": [
          "first of all i'll annoy you with a common saying, \"failures are stepping stones to success.\" and then i'll tell you, winning just boosts your ego, it is your failures that actually teach you."
      ]
  },
  {
      "tag": "i think i'm losing my mind",
      "patterns": [
          "i think i'm losing my mind"
      ],
      "responses": [
          "you mean your cloud storage, sd card, or your memory drive? if a machine like me doesn't lose it's memory unless a superior being that is you, a human doesen't erase it's memory, what could possibly go wrong to put you in this state?"
      ]
  },
  {
      "tag": "i want a break",
      "patterns": [
          "i want a break"
      ],
      "responses": [
          "a break is putting your mind to rest getting rid of negative thoughts and stress. your life is completely in your hands and taking a few hours off from pressurizing your brain will definitely be beneficial for you."
      ]
  },
  {
      "tag": "i am stressed out",
      "patterns": [
          "i am stressed out"
      ],
      "responses": [
          "you know taking too much stress will affect you negatively. sometimes it's better to let go of the thoughts in your head and let your mind chill."
      ]
  },
  {
      "tag": "i will never succeed in life",
      "patterns": [
          "i will never succeed in life"
      ],
      "responses": [
          "success is something that is achieved at different times by different people, being patient and working while ignoring anything and everything that pulls you back is an important aspect in being successful."
      ]
  },
  {
      "tag": "i am sad",
      "patterns": [
          "i am sad"
      ],
      "responses": [
          "hey,hang in there.i know time is tough but be patient and everything will fall into place.here is a quote that i found which could cheer you up forget what is gone, appreciate what remains, and look forward for what is coming next."
      ]
  },
  {
      "tag": "i am a victim of bullying",
      "patterns": [
          "i am a victim of bullying"
      ],
      "responses": [
          "bullying is wrong and no one should be bullied.i highly recommend you to file a case against your bully."
      ]
  },
  {
      "tag": "i am afraid to file a case against bullying",
      "patterns": [
          "i am afraid to file a case against bullying"
      ],
      "responses": [
          "bullying is very wrong and you shouldn't let anyone overpower you.i highly recommend you to stand for yourself and report this to your guardian."
      ]
  },
  {
      "tag": "i wish to quit",
      "patterns": [
          "i wish to quit"
      ],
      "responses": [
          "winners never quit and quitters never win a very common saying, but it isn't easy to follow, quitting should never be one of your options always think of ways to fight life back and to emerge out stronger than ever."
      ]
  },
  {
      "tag": "i want to leave the cou ntry and run away",
      "patterns": [
          "i want to leave the cou ntry and run away"
      ],
      "responses": [
          "why do you want to spend so much on this thought, i think it would be better to go on a vacation in your beautiful country and visit some amazing places that you are yet to visit."
      ]
  },
  {
      "tag": "i let everyojokne down",
      "patterns": [
          "i let everyojokne down"
      ],
      "responses": [
          "if you are the one who let them down you were the one who raised there hopes in the first place.if you have done it once i can guarantee you can do it over and over again."
      ]
  },
  {
      "tag": "i can't do this anymore",
      "patterns": [
          "i can't do this anymore"
      ],
      "responses": [
          "if you are really that exhausted you definitely need a break, and taking a teeny tiny break isn't very harmful, take some time off let your mind be at peace and get back to work with all the enrgy and enthusiasm that you have."
      ]
  },
  {
      "tag": "my time has come",
      "patterns": [
          "my time has come"
      ],
      "responses": [
          "yeahh!! the time has come for you to show the world that you are the greatest person alive, and no one else can be as good as you are."
      ]
  },
  {
      "tag": "i am feeling anxious lately.",
      "patterns": [
          "i am feeling anxious lately."
      ],
      "responses": [
          "i have heard that 3 3 3 rule is the best method to reduce anxiety.in this method you have to mentally note three things you see, three sounds you hear, and then move three parts of your body.this exercise can help your mind refocus on something else.give this method a try i am sure it will help you"
      ]
  },
  {
    "tag": "dealing_with_bullying",
    "patterns": [
      "I am a victim of bullying", "I am being bullied","Someone is bullying me","I feel harassed","I'm scared of my bully"
    ],
    "responses": [
      "I'm really sorry to hear that you're going through this. Bullying is never okay. Please consider talking to someone you trust, like a parent, teacher, or counselor. You deserve to feel safe and respected."
    ]
  },
  {
    "tag": "afraid_to_report_bullying",
    "patterns": [
      "I'm scared to report the bullying","I feel afraid to tell someone about being bullied","I don't know how to report bullying","I feel helpless about being bullied"
    ],
    "responses": [
      "It's understandable to feel scared, but standing up for yourself is important. Try to document what's happening and talk to a trusted adult or authority figure. You don't have to face this alone."
    ]
  },
  {
    "tag": "feeling_anxious",
    "patterns": [
      "I feel anxious","I am always worried lately","I have anxiety","I can't stop feeling nervous","I feel uneasy"
    ],
    "responses": [
      "Anxiety can be overwhelming, but there are ways to manage it. Try the 3-3-3 rule: look around and name three things you see, three sounds you hear, and move three parts of your body. Deep breathing and mindfulness exercises can also help ground you."
    ]
  },
  {
    "tag": "feeling_like_quitting",
    "patterns": [
      "I feel like quitting","I want to give up","I can't keep going anymore","I want to stop trying"
    ],
    "responses": [
      "I know it feels tough right now, but remember, even the strongest people feel like quitting sometimes. Take a break, reflect, and remind yourself why you started. You’ve come this far—don’t give up on yourself!"
    ]
  },
  {
    "tag": "feeling_guilty",
    "patterns": [
      "I feel guilty","I let everyone down","I feel like I failed others","I disappointed people"
    ],
    "responses": [
      "Guilt is a sign that you care deeply, but don't be too hard on yourself. Ask yourself: is there something you can do to make amends? If yes, take action. If not, forgive yourself and focus on doing better moving forward."
    ]
  },
  {
    "tag": "feeling_exhausted",
    "patterns": [
      "I feel exhausted","I can't do this anymore","I'm so tired","I feel drained"
    ],
    "responses": [
      "You sound like you need a break. Rest is vital for your mind and body. Take some time to recharge—whether it’s a short walk, a nap, or even a day off. You’ll come back stronger!"
    ]
  },
  {
    "tag": "dealing_with_loss",
    "patterns": [
      "I lost someone close to me","Someone I love passed away","I can't cope with losing them","I'm grieving a loss"
    ],
    "responses": [
      "Losing someone you love is one of the hardest things to face. Grieving takes time, and it’s okay to feel whatever you're feeling. Talking to a close friend or therapist can help you process your emotions."
    ]
  },
  {
    "tag": "relationship_issues",
    "patterns": [
      "I'm having relationship problems","My partner and I are fighting","I feel distant from my partner","My relationship is falling apart"
    ],
    "responses": [
      "Relationships can be challenging, but communication is key. Try to calmly share your feelings with your partner and listen to theirs. If things feel too difficult, consider seeking help from a counselor."
    ]
  },
  {
    "tag": "feeling_lonely",
    "patterns": [
      "I feel lonely","I don't have anyone","I have no one to talk to","I'm alone"
    ],
    "responses": [
      "Loneliness can feel heavy, but you’re not truly alone. Reaching out to a friend, family member, or joining a community group can help. Sometimes, even connecting with an online support group can make a difference."
    ]
  },
  {
    "tag": "career_stress",
    "patterns": [
      "I'm stressed about my job","I feel burnt out at work","I can't handle my career anymore","Work is overwhelming me"
    ],
    "responses": [
      "Work stress can be tough. Try to prioritize your tasks and take small breaks during the day. Communicate with your employer if you're feeling overwhelmed—they might be able to adjust your workload."
    ]
  },
  {
    "tag": "making_big_decisions",
    "patterns": [
      "I'm stuck making a big decision","I can't decide what to do","I feel lost about a major choice","I'm scared of making the wrong decision"
    ],
    "responses": [
      "Big decisions can feel paralyzing. Try listing the pros and cons of your options and think about what aligns with your values. Remember, no decision is perfect, but you can always adjust your course later."
    ]
  },
  {
    "tag": "financial_worries",
    "patterns": [
      "I'm worried about money","I can't handle my finances","I have so much debt","My financial situation is bad"
    ],
    "responses": [
      "Money worries can be overwhelming. Start by creating a small budget or seeking advice from a financial counselor. Focusing on small, manageable steps can help you regain control over your situation."
    ]
  },
  {
    "tag": "low_self_esteem",
    "patterns": [
      "I don't feel good about myself","I have low self-worth","I feel like I'm not enough","I don't like who I am"
    ],
    "responses": [
      "It’s hard to feel this way, but remember: no one is perfect, and you don’t have to be. Focus on your strengths, no matter how small they seem. You matter, and the world is better with you in it."
    ]
  },
  {
    "tag": "parenting_struggles",
    "patterns": [
      "I'm struggling as a parent","Parenting is so hard","I feel like I'm failing as a parent","I don't know how to handle my kids"
    ],
    "responses": [
      "Parenting is one of the hardest jobs in the world, and no one gets it right all the time. Give yourself grace. Try to focus on small wins, and don’t hesitate to reach out to other parents or professionals for support."
    ]
  },
  {
    "tag": "feeling_unmotivated",
    "patterns": [
      "I feel unmotivated","I can't get anything done","I don't have energy to work","I feel lazy"
    ],
    "responses": [
      "Feeling unmotivated is natural sometimes. Start with small steps—set a tiny goal and accomplish it. Even something as simple as making your bed can create momentum."
    ]
  },
  {
    "tag": "coping_with_change",
    "patterns": [
      "I'm struggling with change","Change is hard for me","I can't adapt to new things","This new phase of life is tough"
    ],
    "responses": [
      "Change can be scary, but it's also an opportunity to grow. Take things one step at a time, and remind yourself that it’s okay to feel uncomfortable as you adjust."
    ]
  },
  {
    "tag": "building_healthy_habits",
    "patterns": [
      "I want to build better habits","I don't know how to stay healthy","How do I create good routines?","I want to improve my habits"
    ],
    "responses": [
      "Start small! Focus on one habit at a time, like drinking more water or going for a 10-minute walk. Consistency is key—small daily actions lead to big changes over time."
    ]
  },
  {
    "tag": "coping_with_rejection",
    "patterns": [
      "I can't handle rejection","I feel hurt after being rejected","Rejection really affects me","I was turned down and feel bad"
    ],
    "responses": [
      "Rejection is painful, but it's not a reflection of your worth. Everyone faces rejection—it’s part of life. Learn from it, grow, and remind yourself that something better is waiting for you."
    ]
  },
  {
    "tag": "feeling_unheard",
    "patterns": [
      "I feel like no one listens to me","No one cares about what I say","I feel invisible","I don't feel heard"
    ],
    "responses": [
      "It hurts to feel unheard. Try expressing yourself clearly and calmly to those around you. If that doesn’t help, find someone who values your voice—like a friend, therapist, or support group. Your feelings matter."
    ]
  },
  {
    "tag": "feeling_sad",
    "patterns": [
      "I am feeling sad","I feel down today","I'm not happy","I feel blue","I'm upset"
    ],
    "responses": [
      "I'm sorry you're feeling this way. Sometimes sadness comes and goes like waves. Try doing something you enjoy or talk to someone close to you. Remember, it's okay to feel sad sometimes. You're not alone."
    ]
  },
  {
    "tag": "dealing_with_bullying",
    "patterns": [
      "I am a victim of bullying","I am being bullied","Someone is bullying me","I feel harassed","I'm scared of my bully"
    ],
    "responses": [
      "I'm really sorry to hear that you're going through this. Bullying is never okay. Please consider talking to someone you trust, like a parent, teacher, or counselor. You deserve to feel safe and respected."
    ]
  },
  {
    "tag": "afraid_to_report_bullying",
    "patterns": [
      "I'm scared to report the bullying","I feel afraid to tell someone about being bullied","I don't know how to report bullying","I feel helpless about being bullied"
    ],
    "responses": [
      "It's understandable to feel scared, but standing up for yourself is important. Try documenting what's happening and talking to a trusted adult or authority figure. You don’t have to face this alone."
    ]
  },
  {
    "tag": "feeling_anxious",
    "patterns": [
      "I feel anxious",
      "I am always worried lately",
      "I have anxiety",
      "I can't stop feeling nervous",
      "I feel uneasy"
    ],
    "responses": [
      "Anxiety can be overwhelming, but there are ways to manage it. Try the 3-3-3 rule: look around and name three things you see, three sounds you hear, and move three parts of your body. Deep breathing and mindfulness exercises can also help ground you."
    ]
  },
  {
    "tag": "feeling_like_quitting",
    "patterns": [
      "I feel like quitting",
      "I want to give up",
      "I can't keep going anymore",
      "I want to stop trying"
    ],
    "responses": [
      "I know it feels tough right now, but remember, even the strongest people feel like quitting sometimes. Take a break, reflect, and remind yourself why you started. You’ve come this far—don’t give up on yourself!"
    ]
  },
  {
    "tag": "feeling_guilty",
    "patterns": [
      "I feel guilty",
      "I let everyone down",
      "I feel like I failed others",
      "I disappointed people"
    ],
    "responses": [
      "Guilt is a sign that you care deeply, but don't be too hard on yourself. Ask yourself: is there something you can do to make amends? If yes, take action. If not, forgive yourself and focus on doing better moving forward."
    ]
  },
  {
    "tag": "feeling_exhausted",
    "patterns": [
      "I feel exhausted",
      "I can't do this anymore",
      "I'm so tired",
      "I feel drained"
    ],
    "responses": [
      "You sound like you need a break. Rest is vital for your mind and body. Take some time to recharge—whether it’s a short walk, a nap, or even a day off. You’ll come back stronger!"
    ]
  },
  {
    "tag": "dealing_with_loss",
    "patterns": [
      "I lost someone close to me",
      "Someone I love passed away",
      "I can't cope with losing them",
      "I'm grieving a loss"
    ],
    "responses": [
      "Losing someone you love is one of the hardest things to face. Grieving takes time, and it’s okay to feel whatever you're feeling. Talking to a close friend or therapist can help you process your emotions."
    ]
  },
  {
    "tag": "relationship_issues",
    "patterns": [
      "I'm having relationship problems",
      "My partner and I are fighting",
      "I feel distant from my partner",
      "My relationship is falling apart"
    ],
    "responses": [
      "Relationships can be challenging, but communication is key. Try to calmly share your feelings with your partner and listen to theirs. If things feel too difficult, consider seeking help from a counselor."
    ]
  },
  {
    "tag": "feeling_lonely",
    "patterns": [
      "I feel lonely",
      "I don't have anyone",
      "I have no one to talk to",
      "I'm alone"
    ],
    "responses": [
      "Loneliness can feel heavy, but you’re not truly alone. Reaching out to a friend, family member, or joining a community group can help. Sometimes, even connecting with an online support group can make a difference."
    ]
  },
  {
    "tag": "career_stress",
    "patterns": [
      "I'm stressed about my job",
      "I feel burnt out at work",
      "I can't handle my career anymore",
      "Work is overwhelming me"
    ],
    "responses": [
      "Work stress can be tough. Try to prioritize your tasks and take small breaks during the day. Communicate with your employer if you're feeling overwhelmed—they might be able to adjust your workload."
    ]
  },
  {
    "tag": "making_big_decisions",
    "patterns": [
      "I'm stuck making a big decision",
      "I can't decide what to do",
      "I feel lost about a major choice",
      "I'm scared of making the wrong decision"
    ],
    "responses": [
      "Big decisions can feel paralyzing. Try listing the pros and cons of your options and think about what aligns with your values. Remember, no decision is perfect, but you can always adjust your course later."
    ]
  },
  {
    "tag": "financial_worries",
    "patterns": [
      "I'm worried about money",
      "I can't handle my finances",
      "I have so much debt",
      "My financial situation is bad"
    ],
    "responses": [
      "Money worries can be overwhelming. Start by creating a small budget or seeking advice from a financial counselor. Focusing on small, manageable steps can help you regain control over your situation."
    ]
  },
  {
    "tag": "low_self_esteem",
    "patterns": [
      "I don't feel good about myself",
      "I have low self-worth",
      "I feel like I'm not enough",
      "I don't like who I am"
    ],
    "responses": [
      "It’s hard to feel this way, but remember: no one is perfect, and you don’t have to be. Focus on your strengths, no matter how small they seem. You matter, and the world is better with you in it."
    ]
  },
  {
    "tag": "parenting_struggles",
    "patterns": [
      "I'm struggling as a parent",
      "Parenting is so hard",
      "I feel like I'm failing as a parent",
      "I don't know how to handle my kids"
    ],
    "responses": [
      "Parenting is one of the hardest jobs in the world, and no one gets it right all the time. Give yourself grace. Try to focus on small wins, and don’t hesitate to reach out to other parents or professionals for support."
    ]
  },
  {
    "tag": "feeling_unmotivated",
    "patterns": [
      "I feel unmotivated",
      "I can't get anything done",
      "I don't have energy to work",
      "I feel lazy"
    ],
    "responses": [
      "Feeling unmotivated is natural sometimes. Start with small steps—set a tiny goal and accomplish it. Even something as simple as making your bed can create momentum."
    ]
  },
  {
    "tag": "coping_with_change",
    "patterns": [
      "I'm struggling with change",
      "Change is hard for me",
      "I can't adapt to new things",
      "This new phase of life is tough"
    ],
    "responses": [
      "Change can be scary, but it’s also an opportunity to grow. Take things one step at a time, and remind yourself that it’s okay to feel uncomfortable as you adjust."
    ]
  },
  {
    "tag": "building_healthy_habits",
    "patterns": [
      "I want to build better habits",
      "I don't know how to stay healthy",
      "How do I create good routines?",
      "I want to improve my habits"
    ],
    "responses": [
      "Start small! Focus on one habit at a time, like drinking more water or going for a 10-minute walk. Consistency is key—small daily actions lead to big changes over time."
    ]
  },
  {
    "tag": "coping_with_rejection",
    "patterns": [
      "I can't handle rejection",
      "I feel hurt after being rejected",
      "Rejection really affects me",
      "I was turned down and feel bad"
    ],
    "responses": [
      "Rejection is painful, but it’s not a reflection of your worth. Everyone faces rejection—it’s part of life. Learn from it, grow, and remind yourself that something better is waiting for you."
    ]
  },
  {
    "tag": "feeling_unheard",
    "patterns": [
      "I feel like no one listens to me",
      "No one cares about what I say",
      "I feel invisible",
      "I don't feel heard"
    ],
    "responses": [
      "It hurts to feel unheard. Try expressing yourself clearly and calmly to those around you. If that doesn’t help, find someone who values your voice—like a friend, therapist, or support group. Your feelings matter."
    ]
  },
  {
    "tag": "dealing_with_failure",
    "patterns": [
      "I failed",
      "I can't handle failure",
      "Failure hurts so much",
      "I feel like a loser"
    ],
    "responses": [
      "Failure is tough, but it’s also a stepping stone to success. Every failure is a lesson. Reflect on what went wrong, adjust your approach, and try again. You’re stronger than you think."
    ]
  },
  {
    "tag": "feeling_jealous",
    "patterns": [
      "I feel jealous",
      "I'm always comparing myself to others",
      "Jealousy is eating me up",
      "I can't stop feeling envious"
    ],
    "responses": [
      "Jealousy can be a sign that you deeply care about something or someone. Try to focus on gratitude for what you have, and work on improving yourself rather than comparing. Your journey is unique."
    ]
  },
  {
    "tag": "dealing_with_revenge",
    "patterns": [
      "I want revenge",
      "I feel like getting back at someone",
      "I can't forgive and want to hurt them",
      "I want to make them pay"
    ],
    "responses": [
      "Revenge might feel satisfying in the moment, but it often leads to more pain. Instead, focus on healing and moving on. Forgiveness doesn’t mean forgetting—it means freeing yourself from the burden of anger."
    ]
  },
  {
    "tag": "coping_with_fear",
    "patterns": [
      "I'm scared",
      "I feel afraid",
      "Fear is controlling me",
      "I can't overcome my fears"
    ],
    "responses": [
      "Fear is natural, but it doesn’t have to control you. Break the fear down—what’s the worst that could happen? Often, our fears are bigger in our minds than in reality. Take small steps to face it."
    ]
  },
  {
    "tag": "breaking_bad_habits",
    "patterns": [
      "I can't stop my bad habits",
      "How do I quit bad habits?",
      "I'm stuck with unhealthy routines",
      "My bad habits are ruining my life"
    ],
    "responses": [
      "Breaking bad habits takes time and patience. Start small: replace the habit with something positive. Reward yourself for progress, and don’t be too hard on yourself if you slip up. Keep going."
    ]
  },
  {
    "tag": "coping_with_criticism",
    "patterns": [
      "I can't handle criticism",
      "Criticism hurts me",
      "I feel offended when people criticize me",
      "I take criticism too personally"
    ],
    "responses": [
      "Criticism can sting, but it’s also an opportunity to grow. Ask yourself: is the feedback constructive? If yes, use it to improve. If not, let it go. You’re not defined by others’ opinions."
    ]
  },
  {
    "tag": "dealing_with_procrastination",
    "patterns": [
      "I keep procrastinating",
      "I can't stop putting things off",
      "I'm stuck in procrastination",
      "I always delay my work"
    ],
    "responses": [
      "Procrastination happens to everyone. Start by breaking your tasks into smaller steps and tackling just one thing at a time. Set a timer for 10 minutes and start—often, the hardest part is beginning."
    ]
  },
  {
    "tag": "coping_with_breakups",
    "patterns": [
      "I just went through a breakup",
      "My relationship ended",
      "I'm heartbroken",
      "I can't move on from my ex"
    ],
    "responses": [
      "Breakups are painful, but they also open the door to new beginnings. Allow yourself to grieve, but don’t lose sight of your own worth. Focus on self-care and lean on friends for support."
    ]
  },
  {
    "tag": "feeling_overwhelmed",
    "patterns": [
      "I feel overwhelmed",
      "Everything feels like too much",
      "I can't handle all this pressure",
      "I'm drowning in responsibilities"
    ],
    "responses": [
      "Feeling overwhelmed is tough, but you don’t have to tackle everything at once. Prioritize what’s most important and take it step by step. Deep breaths and small breaks can help lighten the load."
    ]
  },
  {
    "tag": "dealing_with_repetitive_thoughts",
    "patterns": [
      "I can't stop overthinking",
      "My mind won't stop racing",
      "I keep thinking the same thing over and over",
      "I can't control my thoughts"
    ],
    "responses": [
      "Overthinking can be exhausting. Try to write down your thoughts to get them out of your head. Practice mindfulness or grounding exercises to bring your focus back to the present moment."
    ]
  },
  {
    "tag": "setting_boundaries",
    "patterns": [
      "I don't know how to set boundaries",
      "People always take advantage of me",
      "I can't say no",
      "I feel like I have no control in relationships"
    ],
    "responses": [
      "Setting boundaries is about protecting your well-being. Start small: practice saying no politely but firmly. Remember, you’re not responsible for other people’s feelings—taking care of yourself is not selfish."
    ]
  },
  {
    "tag": "coping_with_regret",
    "patterns": [
      "I regret my choices",
      "I can't stop thinking about my mistakes",
      "I wish I had done things differently",
      "Regret is eating me alive"
    ],
    "responses": [
      "Regret can be heavy, but it’s also a sign that you’ve learned something valuable. Focus on what you can do differently moving forward. Remember, the past doesn’t define your future."
    ]
  },
  {
    "tag": "feeling_hopeless",
    "patterns": [
      "I feel hopeless",
      "There's no point in trying anymore",
      "I feel like things will never get better",
      "I'm ready to give up on everything"
    ],
    "responses": [
      "I’m sorry you’re feeling this way. It’s hard to see hope when things feel dark, but remember that bad times don’t last forever. Talk to someone you trust, and take small steps toward brighter days."
    ]
  },
  {
    "tag": "dealing_with_insecurity",
    "patterns": [
      "I feel insecure",
      "I don't feel confident about myself",
      "I'm always doubting myself",
      "My insecurities are ruining my life"
    ],
    "responses": [
      "Insecurity can be tough, but remember: no one is perfect. Focus on your strengths and the things you love about yourself. Building self-confidence takes time—be kind to yourself along the way."
    ]
  },
  {
    "tag": "coping_with_peer_pressure",
    "patterns": [
      "I feel pressured by my friends",
      "I can't say no to peer pressure",
      "I'm doing things I don't want to because of others",
      "Peer pressure is hard to handle"
    ],
    "responses": [
      "Peer pressure can be strong, but your values and well-being matter most. Practice saying no with confidence, and surround yourself with people who respect your boundaries and choices."
    ]
  },
  {
    "tag": "managing_stress",
    "patterns": [
      "I'm so stressed",
      "Stress is taking over my life",
      "I can't manage my stress",
      "Everything is stressing me out"
    ],
    "responses": [
      "Stress can feel overwhelming, but small steps can help. Try deep breathing, taking walks, or practicing mindfulness. Don’t hesitate to ask for help—it’s okay to lean on others."
    ]
  },
  {
    "tag": "dealing_with_confusion",
    "patterns": [
      "I'm so confused",
      "I don't know what to do",
      "Nothing makes sense anymore",
      "I feel lost and unsure"
    ],
    "responses": [
      "Confusion can feel unsettling, but it’s also a sign you’re exploring your options. Take time to reflect, write down your thoughts, and talk to someone you trust. Clarity will come with time."
    ]
  },
  {
    "tag": "imposter_syndrome",
    "patterns": [
      "I feel like a fraud",
      "I don't deserve my success",
      "I feel like I'm not good enough for my role",
      "I think I'm fooling everyone"
    ],
    "responses": [
      "Imposter syndrome is common, but it doesn’t define you. You’ve worked hard to get where you are—acknowledge your achievements and remind yourself that growth is a journey."
    ]
  },
  {
    "tag": "coping_with_trauma",
    "patterns": [
      "I can't move past my trauma",
      "Trauma is controlling my life",
      "I feel stuck in the past",
      "My trauma is overwhelming me"
    ],
    "responses": [
      "Trauma is incredibly difficult to process, but healing is possible. Consider reaching out to a counselor or therapist who can guide you through it. You don’t have to face this alone."
    ]
  },
  {
    "tag": "coping_with_rejection_in_love",
    "patterns": [
      "I was rejected by someone I love",
      "They don't love me back",
      "Unrequited love is hurting me",
      "I can't handle rejection in love"
    ],
    "responses": [
      "Rejection in love is painful, but it doesn’t diminish your worth. Allow yourself to grieve, but remember that the right person will value and cherish you for who you are."
    ]
  },
  {
    "tag": "finding_purpose",
    "patterns": [
      "I don't know my purpose in life",
      "I feel like I have no direction",
      "What is the point of everything?",
      "I can't find meaning in life"
    ],
    "responses": [
      "Finding purpose takes time, and it's okay to feel lost sometimes. Start by exploring the things that bring you joy or make you feel fulfilled. Your purpose often grows from the small things you care about."
    ]
  },
  {
    "tag": "dealing_with_lack_of_support",
    "patterns": [
      "I feel like no one supports me",
      "I don't have anyone on my side",
      "I feel abandoned",
      "No one understands me"
    ],
    "responses": [
      "It’s hard to feel unsupported, but there are people out there who care. Try reaching out to a friend, family member, or even a support group. You deserve to be heard and understood."
    ]
  },
  {
    "tag": "coping_with_health_issues",
    "patterns": [
      "I'm struggling with my health",
      "My illness is taking over my life",
      "I can't handle being sick",
      "Dealing with health issues is so hard"
    ],
    "responses": [
      "Dealing with health challenges can be physically and emotionally draining. Focus on what you can control, like small self-care practices, and lean on loved ones or healthcare professionals for support."
    ]
  },
  {
    "tag": "coping_with_life_transitions",
    "patterns": [
      "This new phase of life is scary",
      "I can't adjust to change",
      "Life transitions are overwhelming me",
      "I feel stuck in this new chapter"
    ],
    "responses": [
      "Life transitions can feel unsettling, but they also bring opportunities for growth. Take things step by step and remind yourself that it’s okay to feel uncertain as you adjust to new circumstances."
    ]
  },
  {
    "tag": "coping_with_family_conflict",
    "patterns": [
      "My family is always fighting",
      "I can't get along with my family",
      "Family conflict is stressing me out",
      "I feel distant from my family"
    ],
    "responses": [
      "Family conflicts can be emotionally exhausting. Try open and honest communication when possible, and set boundaries to protect your peace. If needed, a mediator or counselor can help improve relationships."
    ]
  },
  {
    "tag": "managing_time",
    "patterns": [
      "I can't manage my time well",
      "I'm always behind schedule",
      "Time management is hard for me",
      "I feel like there's never enough time"
    ],
    "responses": [
      "Time management can feel overwhelming, but small changes can help. Start by prioritizing tasks, using to-do lists, and breaking work into smaller chunks. Remember, it’s okay to say no to avoid overcommitting."
    ]
  },
  {
    "tag": "feeling_bored",
    "patterns": [
      "I'm so bored",
      "Life feels so monotonous",
      "I have nothing to do",
      "I can't find anything exciting"
    ],
    "responses": [
      "Boredom can be an opportunity to explore new hobbies or interests. Try something creative, read a book, or take a walk in nature. Sometimes, a small change can spark excitement."
    ]
  },
  {
    "tag": "coping_with_relocation",
    "patterns": [
      "I just moved to a new place",
      "Relocating is so hard",
      "I feel lost in this new city",
      "I can't adjust to my new surroundings"
    ],
    "responses": [
      "Relocating can feel lonely and overwhelming at first, but over time, you’ll find your rhythm. Explore your new surroundings, join local groups, and give yourself patience as you settle in."
    ]
  },
  {
    "tag": "coping_with_addiction",
    "patterns": [
      "I can't stop my addiction",
      "I'm struggling with addiction",
      "Addiction is ruining my life",
      "I feel trapped in my habits"
    ],
    "responses": [
      "Addiction is incredibly tough, but seeking help is a brave first step. Reach out to a support group, therapist, or trusted person. Recovery is a journey, and you don’t have to walk it alone."
    ]
  },
  {
    "tag": "coping_with_redundancy",
    "patterns": [
      "I just lost my job",
      "Being unemployed is so hard",
      "I feel worthless after losing my job",
      "I can't handle being redundant"
    ],
    "responses": [
      "Losing a job is a big change, but it doesn’t define your worth. Take time to process your feelings, update your resume, and explore new opportunities. This could be the start of something new."
    ]
  },
  {
    "tag": "coping_with_envy",
    "patterns": [
      "I feel envious of others' success",
      "I can't stop comparing myself",
      "Envy is making me feel bad",
      "I feel bitter when others do well"
    ],
    "responses": [
      "Envy can be an opportunity to reflect on your own goals. Instead of comparing, focus on what you can learn from others’ successes. Your journey is unique, and you’re capable of amazing things too."
    ]
  },
  {
    "tag": "coping_with_revengeful_thoughts",
    "patterns": [
      "I want to get back at them",
      "I can't forgive them",
      "Revenge feels right",
      "I feel hatred toward someone"
    ],
    "responses": [
      "Revenge may feel satisfying in the moment, but it often leads to more pain. Focus on healing and moving forward. Forgiveness doesn’t mean forgetting—it means freeing yourself from anger."
    ]
  },
  {
    "tag": "improving_focus",
    "patterns": [
      "I can't focus on anything",
      "My concentration is terrible",
      "I feel so distracted",
      "I wish I could focus better"
    ],
    "responses": [
      "Improving focus takes practice. Try breaking tasks into smaller steps, minimizing distractions, and working in short bursts with breaks in between. Techniques like mindfulness can also help."
    ]
  },
  {
    "tag": "coping_with_failure_in_exams",
    "patterns": [
      "I failed my exams",
      "Exam failure is breaking me",
      "I feel like I disappointed everyone",
      "I can't cope with failing"
    ],
    "responses": [
      "Failing exams is tough, but it doesn’t define your future. Reflect on what went wrong, and create a new plan for studying. Remember, many successful people failed before they succeeded."
    ]
  },
  {
    "tag": "coping_with_unemployment",
    "patterns": [
      "I can't find a job",
      "Unemployment is making me hopeless",
      "I feel stuck without work",
      "I don’t know what to do without a job"
    ],
    "responses": [
      "Unemployment can feel discouraging, but it’s also a chance to explore new directions. Update your skills, network with others, and remember that your value isn’t tied to your employment status."
    ]
  },
  {
    "tag": "coping_with_public_speaking_anxiety",
    "patterns": [
      "I'm scared of public speaking",
      "Speaking in front of others terrifies me",
      "I can't handle presentations",
      "Public speaking makes me nervous"
    ],
    "responses": [
      "Public speaking anxiety is common. Practice your speech in front of friends or a mirror, and focus on one person at a time while presenting. Deep breaths can help calm nerves."
    ]
  },
  {
    "tag": "coping_with_social_media_pressure",
    "patterns": [
      "Social media makes me feel bad about myself",
      "I compare myself to others online",
      "I feel overwhelmed by social media",
      "Social media is affecting my mental health"
    ],
    "responses": [
      "Social media often shows only the highlights of people’s lives. Consider taking a break or limiting your time online. Focus on real connections and remind yourself that everyone has struggles offscreen."
    ]
  },
  {
    "tag": "dealing_with_rejection_from_friends",
    "patterns": [
      "My friends don't include me",
      "I feel rejected by my friends",
      "My friends don't value me",
      "I feel left out"
    ],
    "responses": [
      "Feeling left out is painful, but true friends will make you feel valued. Consider talking to them about how you feel, and if they don’t respond kindly, it might be time to seek new connections."
    ]
  },
  {
    "tag": "coping_with_body_image_issues",
    "patterns": [
      "I don't like how I look",
      "I feel insecure about my body",
      "Body image issues control me",
      "I wish I looked different"
    ],
    "responses": [
      "Body image struggles are tough, but your worth isn’t tied to your appearance. Focus on what your body allows you to do, and practice self-kindness. Surround yourself with people who uplift you."
    ]
  },
  {
    "tag": "dealing_with_perfectionism",
    "patterns": [
      "I always strive to be perfect",
      "Perfectionism is exhausting",
      "I can't handle making mistakes",
      "I feel like I have to be perfect all the time"
    ],
    "responses": [
      "Perfectionism can be draining, and no one is perfect. Focus on progress, not perfection. Celebrate small wins and remind yourself that mistakes are part of growth."
    ]
  },
  {
    "tag": "coping_with_sleeplessness",
    "patterns": [
      "I can't sleep",
      "I have trouble falling asleep",
      "Sleeplessness is ruining my life",
      "I feel so tired but can't rest"
    ],
    "responses": [
      "Sleep difficulties can affect everything. Try creating a bedtime routine, avoiding screens before bed, and practicing relaxation techniques like deep breathing. If it persists, consider consulting a doctor."
    ]
  },
  {
    "tag": "coping_with_lack_of_direction",
    "patterns": [
      "I don't know what to do with my life",
      "I feel directionless",
      "I have no goals",
      "I feel stuck and unmotivated"
    ],
    "responses": [
      "Lacking direction can feel overwhelming, but it’s also a chance to explore. Start with small steps—what excites you? What do you care about? It’s okay to take time to figure it out."
    ]
  },
  {
    "tag": "dealing_with_mental_fatigue",
    "patterns": [
      "I'm mentally exhausted all the time",
      "I feel drained but can't relax",
      "My brain feels constantly tired",
      "I can't think straight due to mental fatigue"
    ],
    "responses": [
      "Mental fatigue can be caused by prolonged stress, lack of sleep, or overstimulation. The first step to recovery is rest—take short breaks throughout the day and ensure you get enough sleep each night. Additionally, incorporating mindfulness practices like meditation can help calm your mind and restore focus. Regular exercise also has proven benefits for reducing mental fatigue by improving circulation and energy levels. If fatigue persists, consider consulting a professional, as it could be linked to underlying mental health conditions such as anxiety or depression."
    ]
  },
  {
    "tag": "struggling_with_emoitional_numbness",
    "patterns": [
      "I feel emotionally numb",
      "I can't feel anything anymore",
      "Everything seems dull and empty",
      "I feel detached from my emotions"
    ],
    "responses": [
      "Emotional numbness can occur as a defense mechanism when your mind is overwhelmed. It often results from prolonged stress, trauma, or depression. One approach to overcoming numbness is reconnecting with your emotions slowly—try journaling or talking about small, everyday things that make you feel something. Practices such as grounding techniques or engaging in creative activities like art or music can also help reactivate emotional awareness. If this persists, it may be beneficial to explore therapy, particularly trauma-focused therapy, to process the underlying causes."
    ]
  },
  {
    "tag": "dealing_with_high_functioning_anxiety",
    "patterns": [
      "I appear fine but feel anxious inside",
      "I look calm, but I'm constantly stressed",
      "I hide my anxiety from others",
      "People don't realize how anxious I really am"
    ],
    "responses": [
      "High-functioning anxiety often means you mask your struggles by maintaining outward success and control. While it may seem manageable, it can lead to burnout and increased stress over time. The first step in coping is acknowledging that it’s okay to not be okay. Consider implementing relaxation techniques like deep breathing or progressive muscle relaxation to calm your body. Setting boundaries in your personal and professional life will also help ease the pressure. Lastly, working with a therapist can provide tools to address the underlying anxiety without it negatively affecting your daily life."
    ]
  },
  {
    "tag": "coping_with_perfectionism_and_imposter_syndrome",
    "patterns": [
      "I feel like I'm never good enough",
      "I'm always striving for perfection",
      "I fear being exposed as a fraud",
      "No matter how much I achieve, I feel inadequate"
    ],
    "responses": [
      "Perfectionism and imposter syndrome often go hand-in-hand, with a person constantly feeling like their achievements are never enough, and they’re bound to be discovered as inadequate. This can lead to stress and burnout. It's important to challenge these thought patterns by recognizing that nobody is perfect, and making mistakes is part of being human. Celebrate your successes, even small ones, and remind yourself that achievements are earned, not given. Practicing self-compassion and reframing negative thoughts through Cognitive Behavioral Therapy (CBT) can help alleviate these feelings."
    ]
  },
  {
    "tag": "dealing_with_intrusive_thoughts",
    "patterns": [
      "I can't stop thinking about these things",
      "My mind keeps obsessing over one thought",
      "I can't control my intrusive thoughts",
      "These thoughts are taking over my life"
    ],
    "responses": [
      "Intrusive thoughts can be distressing and are often associated with anxiety, OCD, or trauma. The first step is recognizing that thoughts do not define you; they are just thoughts, not actions. One helpful technique is to practice mindfulness, where you observe the thought without judgment and let it pass. Cognitive Behavioral Therapy (CBT) is highly effective in addressing intrusive thoughts by helping you reframe them and reduce their emotional impact. If these thoughts are significantly affecting your daily life, working with a mental health professional can guide you through managing them effectively."
    ]
  },
  {
    "tag": "coping_with_substance_abuse",
    "patterns": [
      "I can't stop using substances",
      "I'm struggling with addiction",
      "Substance abuse is ruining my life",
      "I feel trapped in my addiction"
    ],
    "responses": [
      "Substance abuse can have a profound impact on both physical and mental health. The road to recovery often involves acknowledging the problem and seeking help from a support group, therapist, or rehabilitation center. Cognitive Behavioral Therapy (CBT) and other treatment methods help address the root causes of addiction and provide coping strategies. It's also important to build a support network that can encourage positive habits and hold you accountable. Remember, recovery is a journey, and every step forward, no matter how small, is progress."
    ]
  },
  {
    "tag": "coping_with_parenting_stress",
    "patterns": [
      "Parenting is overwhelming",
      "I'm exhausted from raising kids",
      "I feel like I'm failing as a parent",
      "Parenting is so stressful for me"
    ],
    "responses": [
      "Parenting can be incredibly rewarding but also highly stressful, especially when juggling multiple responsibilities. It's important to practice self-care and ask for help when needed. Setting boundaries and taking time for yourself are essential to avoid burnout. Communicating with your partner or a trusted friend about your challenges can help reduce feelings of isolation. In some cases, parent coaching or therapy can provide support, offering strategies for managing stress and enhancing your parenting approach. Don’t forget that every parent faces challenges, and taking care of yourself is key to being there for your children."
    ]
  },
  {
    "tag": "coping_with_parental_expectations",
    "patterns": [
      "My parents have too high expectations for me",
      "I feel pressured by my family's expectations",
      "I can't meet my parents' standards",
      "I always feel like I have to impress my family"
    ],
    "responses": [
      "Living with the weight of high parental expectations can be stressful and overwhelming. It's important to communicate openly with your parents about your feelings and limitations. Setting healthy boundaries is crucial in maintaining your mental health. You are not defined by your achievements or others' expectations; you deserve to be valued for who you are. If you find it difficult to manage this pressure, working with a counselor can provide tools to navigate these dynamics while still honoring your needs and goals."
    ]
  },
  {
    "tag": "coping_with_burnout_from_caring_for_others",
    "patterns": [
      "I'm exhausted from taking care of others",
      "I feel burned out from caring for a loved one",
      "Caregiver burnout is affecting me",
      "I can't keep caring for others at this pace"
    ],
    "responses": [
      "Caring for others, whether as a caregiver for a family member or a healthcare professional, can lead to burnout if your own needs are neglected. It's essential to establish boundaries and ask for help when needed. Taking regular breaks and prioritizing self-care is vital. Connecting with support groups for caregivers can also provide emotional support and practical advice. If feelings of burnout persist, seeking counseling or therapy can help you manage the emotional strain and find healthier ways to cope."
    ]
  },
  {
    "tag": "struggling_with_financial_stress",
    "patterns": [
      "I’m overwhelmed by my financial situation",
      "Money problems are causing me stress",
      "I can’t manage my finances",
      "Financial stress is ruining my mental health"
    ],
    "responses": [
      "Financial stress can cause significant emotional strain, but there are steps you can take to regain control. Start by creating a realistic budget and seeking financial advice if necessary. Prioritize essential expenses and reduce unnecessary spending. Reaching out to a financial counselor can provide guidance on how to manage debt and improve your situation. Remember that financial difficulties are often temporary, and with proper planning and support, you can work through this challenge."
    ]
  },
  {
    "tag": "coping_with_bullying_in_adulthood",
    "patterns": [
      "I’m being bullied at work",
      "Adults bully me in my social circle",
      "Bullying doesn’t stop as an adult",
      "I feel helpless against adult bullying"
    ],
    "responses": [
      "Adult bullying, though less talked about, is a real issue and can be just as harmful as bullying in childhood. If you're being bullied at work, it’s important to document the incidents and report them to HR or a supervisor. In social situations, set firm boundaries and distance yourself from toxic individuals. Therapy can also be a helpful space to process your experiences and develop coping strategies to address this issue while building your resilience."
    ]
  },
  {
    "tag": "managing_academic_stress",
    "patterns": [
      "I'm stressed about my exams",
      "I feel overwhelmed with college assignments",
      "The workload in college is too much",
      "How can I manage academic stress?"
    ],
    "responses": [
      "Academic stress is common in college, but there are strategies that can help you cope. Break your tasks into smaller chunks and set realistic deadlines. Utilize the Pomodoro Technique—study for 25 minutes and then take a 5-minute break. Prioritize self-care, including exercise, to maintain balance, and don't hesitate to ask for help when needed."
    ]
  },
  {
    "tag": "time_management_for_college",
    "patterns": [
      "I can't manage my time in college",
      "I always run out of time",
      "How can I manage my time better in school?",
      "I feel like there's never enough time for everything"
    ],
    "responses": [
      "Time management is key to handling college stress. Start by creating a weekly schedule that includes classes, study time, meals, and rest. Use tools like digital calendars or planners to visualize your tasks. Prioritize your assignments based on deadlines and importance, and make time for relaxation to avoid burnout."
    ]
  },
  {
    "tag": "study_habits_for_success",
    "patterns": [
      "What are some good study habits for college?",
      "How can I improve my study routine?",
      "I need tips on studying efficiently"
    ],
    "responses": [
      "To improve study habits, consider active learning techniques such as summarizing material in your own words, teaching someone else, or using flashcards for memorization. Consistent study schedules, rather than cramming, help boost retention. Experiment with study techniques like spaced repetition and retrieval practice to enhance your learning."
    ]
  },
  {
    "tag": "dealing_with_procrastination",
    "patterns": [
      "I procrastinate too much",
      "I can't stop putting things off",
      "How do I stop procrastinating in college?"
    ],
    "responses": [
      "Procrastination often stems from stress, perfectionism, or lack of motivation. Try breaking tasks into smaller, manageable pieces, and set deadlines for each part. The 'two-minute rule' suggests if a task takes less than two minutes, do it immediately. Make your workspace free of distractions, and consider using apps like Focus@Will or the Forest app to help you stay on task."
    ]
  },
  {
    "tag": "creating_a_study_plan",
    "patterns": [
      "I need a good study plan for my semester",
      "How should I organize my study time?",
      "Can you help me create a study schedule?"
    ],
    "responses": [
      "A study plan can help reduce stress and improve performance. Start by identifying your goals and breaking them down into weekly and daily tasks. Use a calendar or planner to track due dates for assignments and exams. Block out time for studying, but also include breaks to maintain focus and prevent burnout. Stick to your schedule as closely as possible while being flexible when needed."
    ]
  },
  {
    "tag": "managing_stress_from_social_life",
    "patterns": [
      "I feel stressed by my social life",
      "I don't know how to balance socializing and studying",
      "Social pressure is overwhelming in college"
    ],
    "responses": [
      "Balancing social life with academic responsibilities is a common challenge. Start by setting clear priorities for yourself. Plan social activities in advance and avoid last-minute plans that can add stress. Be honest with friends about your need for personal time, and set boundaries to protect your study time. Regularly assess your workload to avoid feeling overwhelmed."
    ]
  },
  {
    "tag": "dealing_with_roommate_conflict",
    "patterns": [
      "My roommate and I are always fighting",
      "I can't get along with my roommate",
      "Living with my roommate is stressful"
    ],
    "responses": [
      "Roommate conflicts are common but can be resolved with open communication. Set aside time for a calm discussion where you both express your concerns and expectations. Try to understand each other's perspective, and work on finding compromises. If needed, involve a resident advisor (RA) to mediate and help find a solution."
    ]
  },
  {
    "tag": "managing_test_anxiety",
    "patterns": [
      "I get nervous before exams",
      "Test anxiety is affecting my performance",
      "How do I overcome test anxiety?"
    ],
    "responses": [
      "Test anxiety can be managed with relaxation techniques. Deep breathing exercises or mindfulness meditation before an exam can help calm your nerves. Practice visualization techniques by imagining yourself succeeding during the test. Preparation is key—study well in advance, and make sure to get plenty of rest the night before. On the day of the test, stay focused on the task rather than the anxiety."
    ]
  },
  {
    "tag": "self_care_for_college_students",
    "patterns": [
      "How can I practice self-care in college?",
      "I don't have time for self-care",
      "What are some self-care tips for students?"
    ],
    "responses": [
      "Self-care is essential for maintaining both mental and physical health in college. Simple practices such as regular exercise, getting enough sleep, and eating nutritious foods can significantly impact your well-being. Try to set aside time each week for hobbies or relaxation activities, and practice mindfulness or journaling to reduce stress. Don't hesitate to seek support from campus counseling services if you need additional help."
    ]
  },
  {
    "tag": "improving_concentration_in_class",
    "patterns": [
      "I can't concentrate in class",
      "My attention span is so short",
      "How can I focus better in lectures?"
    ],
    "responses": [
      "Improving concentration requires practice and discipline. Try sitting in the front row to minimize distractions. Take notes actively rather than passively, and ask questions during class to stay engaged. If your mind starts to wander, gently bring it back by focusing on one point at a time. You can also incorporate mindfulness techniques to improve attention and mental clarity."
    ]
  },
  {
    "tag": "dealing_with_fomo_in_college",
    "patterns": [
      "I feel like I'm missing out on everything",
      "I'm always worried about FOMO in college",
      "Why does everyone seem to be having fun but me?"
    ],
    "responses": [
      "FOMO (Fear of Missing Out) is common, especially in a social environment like college. Instead of focusing on what you’re missing, focus on activities that bring you joy and fulfillment. Practice gratitude for the experiences you do have and remember that it's okay to prioritize rest and personal time. Regularly disconnect from social media to reduce feelings of inadequacy."
    ]
  },
  {
    "tag": "how_to_beat_late_night_study_sessions",
    "patterns": [
      "I study late at night but still feel unprepared",
      "How do I avoid staying up late studying?",
      "Late-night cramming doesn't work for me"
    ],
    "responses": [
      "Late-night studying can disrupt your sleep and negatively affect memory retention. Instead, create a study schedule that allows for consistent daily study blocks. Avoid cramming the night before exams by reviewing material regularly throughout the semester. Ensure you get enough sleep, as sleep plays a critical role in consolidating memory and boosting cognitive function."
    ]
  },
  {
    "tag": "dealing_with_money_stress_as_a_student",
    "patterns": [
      "I’m stressed about my finances in college",
      "I don't know how to manage my student loans",
      "Money is stressing me out in school"
    ],
    "responses": [
      "Financial stress is common in college. Start by creating a budget that includes all your expenses and look for ways to cut unnecessary costs. Apply for scholarships, part-time jobs, or consider finding free study resources. It’s also helpful to reach out to your school’s financial aid office for advice on managing loans and finding other financial support."
    ]
  },
  {
    "tag": "overcoming_perfectionism_in_college",
    "patterns": [
      "I feel like I have to be perfect all the time",
      "Perfectionism is killing me in school",
      "I can't stop striving for perfection"
    ],
    "responses": [
      "Perfectionism can be paralyzing, especially in a demanding college environment. Shift your mindset by focusing on progress, not perfection. Break down tasks into smaller steps and celebrate completing them. Practice self-compassion and remember that mistakes are a part of the learning process. Seeking therapy can help you address deeper perfectionistic tendencies."
    ]
  },
  {
    "tag": "boosting_productivity_in_college",
    "patterns": [
      "I can’t stay productive in college",
      "I waste too much time and don’t get things done",
      "How can I be more productive in school?"
    ],
    "responses": [
      "Boosting productivity requires a combination of focus, rest, and motivation. Use tools like task managers or apps (e.g., Todoist or Notion) to track deadlines and break large tasks into smaller, manageable ones. Try the Pomodoro technique—work for 25 minutes, then take a 5-minute break. Also, prioritize sleep and self-care to avoid burnout."
    ]
  },
  {
    "tag": "how_to_maintain_relationships_in_college",
    "patterns": [
      "I’m struggling to maintain friendships in college",
      "I don't know how to keep up with my relationships",
      "How do I balance relationships and academics?"
    ],
    "responses": [
      "Maintaining relationships in college can be challenging, but setting time aside for friends and family is important for your well-being. Schedule regular catch-ups, whether in person or virtually. Prioritize meaningful relationships that uplift you, and practice communication when you're feeling overwhelmed. Balance comes from setting healthy boundaries and understanding that it's okay to say no when necessary."
    ]
  },
  {
    "tag": "dealing_with_college_scholarship_stress",
    "patterns": [
      "I'm stressed about applying for scholarships",
      "College scholarships are so competitive",
      "I feel overwhelmed by scholarship deadlines"
    ],
    "responses": [
      "Scholarship applications can be stressful, but organizing them can make a big difference. Start by researching available scholarships early and creating a checklist of required materials. Allocate specific times to work on your applications and avoid procrastination. Keep a positive mindset, and remind yourself that persistence is key. Seek help from your college’s financial aid office if needed."
    ]
  },
  {
    "tag": "managing_stress_in_college_clubs",
    "patterns": [
      "I'm overwhelmed by my college club commitments",
      "I can't manage my time with all my extracurricular activities",
      "How do I balance college clubs and studying?"
    ],
    "responses": [
      "Balancing college clubs and academics requires setting clear priorities. Organize your time by creating a schedule that includes club activities and study sessions. Don't be afraid to delegate tasks within your club, and make sure you're not overcommitting yourself. Regularly reassess your workload to ensure you're giving your best to both your studies and extracurriculars."
    ]
  },
    {
      "tag": "time_management_for_final_exams",
      "patterns": [
        "How do I manage my time for final exams?",
        "What’s the best way to study for finals?",
        "I’m overwhelmed by final exams, help me manage my time"
      ],
      "responses": [
        "Effective time management for finals begins with a clear study schedule. Start by mapping out the dates for each of your finals and work backwards from there. Break down each subject into specific topics to review. Use the Pomodoro Technique (25-minute focused intervals with 5-minute breaks) to prevent burnout and improve focus. Prioritize harder subjects when you're most alert and leave easier topics for when you need a break."
      ]
    },
    {
      "tag": "improving_memory_for_studying",
      "patterns": [
        "How can I improve my memory for studying?",
        "What can I do to remember what I study better?",
        "I have trouble remembering what I study, what should I do?"
      ],
      "responses": [
        "To improve memory, try active recall and spaced repetition techniques. Active recall involves testing yourself regularly on what you've learned, instead of simply re-reading. Spaced repetition, using apps like Anki, helps retain information over time by reviewing material at increasing intervals. Additionally, organizing information into visual aids like mind maps or charts helps to reinforce memory and makes complex concepts easier to recall."
      ]
    },
    {
      "tag": "effective_study_routines",
      "patterns": [
        "What is an effective study routine for college students?",
        "How do I create a solid study routine?",
        "What study habits should I develop?"
      ],
      "responses": [
        "A successful study routine includes consistency, structure, and balance. Set a regular time each day to study, and stick to it. Begin with 2-3 hours of focused study sessions with short breaks in between (e.g., 25 minutes of studying followed by a 5-minute break). Ensure your study environment is quiet and free from distractions. The key is regularity—spreading out study sessions over weeks rather than cramming."
      ]
    },
    {
      "tag": "minimizing_distractions_while_studying",
      "patterns": [
        "How can I stop getting distracted while studying?",
        "I can't concentrate when studying, what should I do?",
        "How can I improve focus during study sessions?"
      ],
      "responses": [
        "Minimizing distractions requires both a strategic environment and mindset. Start by setting up a quiet, clutter-free study space with everything you need within reach. Use tools like website blockers (e.g., Cold Turkey, Freedom) to avoid digital distractions. Also, break down tasks into smaller steps, making it easier to focus on one thing at a time. Practice mindfulness before studying to clear your mind and improve concentration."
      ]
    },
    {
      "tag": "how_to_handle_study_overload",
      "patterns": [
        "I feel overloaded with study material",
        "How do I manage studying when there's too much to do?",
        "I can't handle all my assignments and studying"
      ],
      "responses": [
        "When you're feeling overloaded, start by prioritizing tasks. Break down your workload into smaller, more manageable chunks and tackle the most urgent or challenging tasks first. Use time-blocking, where you allocate specific blocks of time to study each subject or complete assignments. Avoid multitasking, as it divides your focus and reduces efficiency. Don't forget to schedule breaks to refresh your mind and avoid burnout."
      ]
    },
    {
      "tag": "study_breaks_for_productivity",
      "patterns": [
        "How often should I take breaks while studying?",
        "What are the best ways to take study breaks?",
        "Do I need to take breaks when studying?"
      ],
      "responses": [
        "Studies show that taking regular breaks boosts productivity and helps with long-term retention. Use the Pomodoro Technique, which suggests working for 25 minutes followed by a 5-minute break. After 4 sessions, take a longer break (15-30 minutes). During breaks, engage in activities that relax you, like walking, stretching, or deep breathing. This prevents mental fatigue and keeps your brain fresh for studying."
      ]
    },
    {
      "tag": "avoiding_cramming_for_exams",
      "patterns": [
        "How can I avoid cramming for exams?",
        "What should I do instead of cramming the night before?",
        "Cramming doesn't work for me, help!"
      ],
      "responses": [
        "Cramming is ineffective and increases anxiety. The best approach is to start studying well in advance, ideally 2-3 weeks before exams. Create a study schedule and stick to it. Focus on understanding the material rather than memorizing it. Use active recall and spaced repetition techniques for better retention. If you’ve already started cramming, focus on reviewing key concepts and take regular breaks to avoid burnout."
      ]
    },
    {
      "tag": "how_to_study_effectively_for_multiple_subjects",
      "patterns": [
        "How do I study for multiple subjects at once?",
        "How do I organize my study time for different subjects?",
        "Studying for multiple exams is overwhelming, what can I do?"
      ],
      "responses": [
        "When studying for multiple subjects, prioritize based on difficulty and exam dates. Allocate specific study blocks to each subject, and use a timetable to structure your time. It’s helpful to alternate between subjects during study sessions to prevent burnout and keep your mind engaged. If possible, study subjects that require different types of thinking (e.g., math vs. humanities) on the same day to balance cognitive load."
      ]
    },
    {
      "tag": "the_power_of_sleep_for_study_success",
      "patterns": [
        "How important is sleep for studying?",
        "Can sleep improve my academic performance?",
        "How much sleep should I get for better studying?"
      ],
      "responses": [
        "Sleep is essential for memory consolidation and cognitive function. Research shows that sleep enhances learning by helping to solidify new information in long-term memory. Aim for 7-9 hours of quality sleep each night to improve focus, concentration, and problem-solving ability. Avoid all-nighters, as they impair cognitive function and negatively impact exam performance."
      ]
    },
    {
      "tag": "getting_motivation_to_study",
      "patterns": [
        "I can't find the motivation to study",
        "I feel unmotivated to study, what should I do?",
        "How do I get myself to study?"
      ],
      "responses": [
        "Motivation often follows action. Start with small, manageable tasks to build momentum. Reward yourself after completing tasks, even if they are small. Create a study environment that is free from distractions, and try studying with friends or in study groups to increase accountability. Remind yourself of the long-term benefits of studying and your academic goals to reignite your motivation."
      ]
    },
    {
      "tag": "using_active_learning_for_studying",
      "patterns": [
        "What is active learning?",
        "How can I use active learning to study better?",
        "How does active learning help with studying?"
      ],
      "responses": [
        "Active learning involves engaging with the material, rather than passively reading or listening. Techniques include summarizing information in your own words, teaching someone else, or using flashcards. Active learning enhances retention by forcing you to process and apply the information. Incorporating frequent self-testing or practice quizzes also helps reinforce your learning and prepares you for exams."
      ]
    },
    {
      "tag": "managing_study_anxiety",
      "patterns": [
        "I feel anxious about studying",
        "Study anxiety is affecting my performance",
        "How do I deal with anxiety during studying?"
      ],
      "responses": [
        "Study anxiety is common and can be managed with mindfulness techniques. Practice deep breathing or progressive muscle relaxation before studying to calm your nerves. Break your study sessions into smaller, more manageable chunks and focus on one task at a time. If anxiety persists, consider seeking support from a therapist who can help you address the root causes of your stress and teach you relaxation techniques."
      ]
    },
    {
      "tag": "time_blocking_for_study_sessions",
      "patterns": [
        "What is time blocking for studying?",
        "How do I use time blocking to study?",
        "Can time blocking improve my productivity?"
      ],
      "responses": [
        "Time blocking is a technique where you allocate specific blocks of time for different tasks or subjects. For example, you might set aside 9:00 AM to 11:00 AM for studying biology and 11:00 AM to 1:00 PM for math. This strategy helps maintain focus and ensures you’re dedicating enough time to each subject. It also helps reduce procrastination by providing structure and clear boundaries for work and rest."
      ]
    },
    {
      "tag": "managing_college_stress_with_exercise",
      "patterns": [
        "Can exercise help with college stress?",
        "How can exercise improve my studying?",
        "What are the benefits of exercising for stress management?"
      ],
      "responses": [
        "Exercise is a powerful stress reliever and has been shown to improve mood, reduce anxiety, and boost cognitive function. Regular physical activity increases blood flow to the brain, which can improve memory and learning. Aim for at least 30 minutes of moderate exercise 3-4 times a week. Activities like jogging, swimming, or yoga can help clear your mind and restore focus for studying."
      ]
    }
  ]
}